// src/data/catalog.mock.js

export const catalog = [
  {
    id: "energy",
    title: "Енергонезалежність",
    sections: [
      {
        title: "Популярні категорії",
        items: [
          "Повербанки для ноутбуків",
          "Зарядна станція EcoFlow DELTA 3 Plus",
          "Батарейки типу AA",
          "Повербанки Xiaomi",
          "ДБЖ для роутера",
          "Розумні розетки TP-LINK",
          "Батарейки типу КРОНА",
          "Додаткові батареї для зарядних станцій",
          "Батарейки типу CR2032",
          "Повербанки для роутерів",
          "Сонячні панелі EcoFlow",
          "Стабілізатори напруги",
          "Генератори RZTK",
          "Батарейки типу AAA",
          "Проектори",
        ],
      },
      {
        title: "Зарядні станції",
        items: ["Ecoflow", "Anker", "Bluetti", "Zendure", "Jackery", "Oukitel"],
      },
      {
        title: "Повербанки",
        items: [
          "До 5000 мА·год",
          "5000–9999 мА·год",
          "10000–15999 мА·год",
          "16000–20999 мА·год",
          "21000–49999 мА·год",
          "50000+ мА·год",
        ],
      },
      {
        title: "Альтернативні джерела енергії",
        items: [
          "Сонячні панелі",
          "Вітрогенератори",
          "Автономні системи резервного живлення",
        ],
      },
    ],
  },

  {
    id: "laptops",
    title: "Ноутбуки та компʼютери",
    sections: [
      {
        title: "Ноутбуки",
        items: ["Для роботи", "Для навчання", "Ігрові", "Ультрабуки"],
      },
      {
        title: "Компʼютери",
        items: ["Системні блоки", "Моноблоки", "Міні ПК"],
      },
      {
        title: "Комплектуючі",
        items: ["Процесори", "Відеокарти", "Материнські плати", "ОЗП"],
      },
    ],
  },

  {
    id: "phones",
    title: "Смартфони, ТВ і електроніка",
    sections: [
      {
        title: "Смартфони",
        items: ["Apple", "Samsung", "Xiaomi", "Google Pixel"],
      },
      {
        title: "Телевізори",
        items: ["Samsung", "LG", "Sony", "Philips"],
      },
    ],
  },
];
